//Напишіть скрипт, який просить відвідувача ввести два числа, і в результаті показує їх суму.

let a = +prompt("Введите число a:", '');
let b = +prompt("Введите число b:", '');

alert(a + b);

//nu tut ya v shokax
alert(1.35.toFixed(1)); // 1.4
alert(6.35.toFixed(1)); // 6.3

//Десятковий дріб 6.35 являє собою нескінченний двійковий код. Як завжди в таких випадках, він зберігається з втратою точності.
alert(6.35.toFixed(20)); // 6.34999999999999964473
alert(Math.round(6.35 * 10) / 10); // 6.35 -> 63.5 -> 64(округлене) -> 6.4


/*Створіть функцію readNumber, яка запросить число, поки відвідувач не введе дійсне числове значення.

Отримане значення потрібно повернути як число.

Відвідувач також може зупинити процес, ввівши порожній рядок або натиснувши “CANCEL”. У цьому випадку функція повинна повернути null.*/

while (true) {
    let input = +prompt("enter the number ", '')
    if (!isNaN(input) && input.trim() !== '') {
        break;
    }
}
